In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('employee.csv')

In [6]:
df['DEPARTMENT'].value_counts()

Houston Police Department-HPD     638
Houston Fire Department (HFD)     384
Public Works & Engineering-PWE    343
Health & Human Services           110
Houston Airport System (HAS)      106
Parks & Recreation                 74
Solid Waste Management             43
Library                            36
Fleet Management Department        36
Admn. & Regulatory Affairs         29
Municipal Courts Department        28
Human Resources Dept.              24
Houston Emergency Center (HEC)     23
General Services Department        22
Housing and Community Devp.        22
Legal Department                   17
Dept of Neighborhoods (DON)        17
City Council                       11
Finance                            10
Houston Information Tech Svcs       9
Planning & Development              7
Mayor's Office                      5
City Controller's Office            5
Convention and Entertainment        1
Name: DEPARTMENT, dtype: int64

In [7]:
df['BASE_SALARY'].sum()

105178319.0

In [8]:
df['BASE_SALARY'].min()

24960.0

In [9]:
df['BASE_SALARY'].max()

275000.0

In [10]:
df['BASE_SALARY'].mean()

55767.93160127253

In [11]:
df['BASE_SALARY'].std()

21693.706679449504

In [12]:
df['BASE_SALARY'].var()

470616909.49399203

In [16]:
s = df['BASE_SALARY'].apply(lambda v : 0.1 * v)
s.head()

0    12186.2
1     2612.5
2     4527.9
3     6316.6
4     5634.7
Name: BASE_SALARY, dtype: float64

In [17]:
df['BASE_SALARY'].count()

1886

In [20]:
base_salary =  df['BASE_SALARY'].fillna(1000.0)

In [21]:
bs = df['BASE_SALARY'].dropna()

In [23]:
bs.count()

1886

In [32]:
gb = df.groupby('DEPARTMENT').count()
gb.head()

,POSITION_TITLE,BASE_SALARY,RACE,EMPLOYMENT_TYPE,GENDER,HIRE_DATE,JOB_DATE
DEPARTMENT,,,,,,,
Admn. & Regulatory Affairs,29,29,26,29,29,29,28
City Controller's Office,5,5,5,5,5,5,5
City Council,11,9,9,11,11,11,11
Convention and Entertainment,1,1,1,1,1,1,1
Dept of Neighborhoods (DON),17,17,17,17,17,17,17

In [34]:
gb = df.groupby('DEPARTMENT')[['GENDER','RACE']].count()
gb.head()

                              GENDER  RACE
DEPARTMENT
Admn. & Regulatory Affairs        29    26
City Controller's Office           5     5
City Council                      11     9
Convention and Entertainment       1     1
Dept of Neighborhoods (DON)       17    17

In [43]:
gb = df.groupby(['DEPARTMENT','RACE'])['BASE_SALARY'].mean()
gb.loc[('Library','Black or African American')].mean()

46305.916666666664

In [50]:
gb = df.groupby(['DEPARTMENT','RACE'])['BASE_SALARY'].apply(lambda s : s.mean())
gb

DEPARTMENT                      RACE
Admn. & Regulatory Affairs      Asian/Pacific Islander                72293.666667
                                Black or African American             46410.833333
                                Hispanic/Latino                       36400.000000
                                White                                 77437.200000
City Controller's Office        Asian/Pacific Islander                59077.000000
                                Black or African American             51743.333333
                                Hispanic/Latino                       64251.000000
City Council                    Black or African American             77000.000000
                                Hispanic/Latino                       35837.000000
                                White                                 64241.500000
Convention and Entertainment    Hispanic/Latino                       38397.000000
Dept of Neighborhoods (DON)     American Indian or Alaskan Native     26125.000000
                                Black or African American             48724.700000
                                Hispanic/Latino                       44275.000000
                                White                                 65832.000000
Finance                         Black or African American             78560.800000
                                Hispanic/Latino                       82799.750000
Fleet Management Department     Asian/Pacific Islander                46010.000000
                                Black or African American             40245.000000
                                Hispanic/Latino                       42667.666667
                                White                                 52944.400000
General Services Department     Black or African American             28741.600000
                                Hispanic/Latino                       49269.300000
                                White                                 70301.000000
Health & Human Services         American Indian or Alaskan Native     54117.000000
                                Asian/Pacific Islander                55357.909091
                                Black or African American             55905.117647
                                Hispanic/Latino                       36223.851852
                                Others                                51278.000000
                                White                                 61674.750000
                                                                         ...
Legal Department                White                                 96793.125000
Library                         American Indian or Alaskan Native     26125.000000
                                Asian/Pacific Islander                37440.000000
                                Black or African American             46305.916667
                                Hispanic/Latino                       46777.750000
                                White                                 43886.000000
Mayor's Office                  Asian/Pacific Islander                60925.000000
                                Black or African American             44990.000000
                                Hispanic/Latino                       95783.000000
                                White                                115375.000000
Municipal Courts Department     Asian/Pacific Islander                         NaN
                                Black or African American             45469.933333
                                Hispanic/Latino                       52782.500000
                                White                                 79727.200000
Parks & Recreation              Asian/Pacific Islander                48651.000000
                                Black or African American             36815.750000
                                Hispanic/Latino                       41315.625000
                                White                                 43630.500000
Planning & Development          Asian/Pacific Islander                65402.000000
                                Black or African American             68762.000000
                                Hispanic/Latino                       47098.333333
                                White                                 54349.000000
Public Works & Engineering-PWE  Asian/Pacific Islander                66915.620690
                                Black or African American             42486.888235
                                Hispanic/Latino                       45502.838235
                                White                                 65720.878378
Solid Waste Management          Asian/Pacific Islander                37898.000000
                                Black or African American             40849.777778
                                Hispanic/Latino                       44334.700000
                                White                                 77966.000000
Name: BASE_SALARY, Length: 94, dtype: float64

In [51]:
sd = pd.read_csv('sample_data.csv', index_col=0)

In [52]:
sd

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [55]:
sd.sort_values('age',ascending=False)

          state  color    food  age  height  score
Cornelia     TX    red   Beans   69     150    2.2
Christina    TX  black   Melon   33     172    9.5
Dean         AK   gray  Cheese   32     180    1.8
Jane         NY   blue   Steak   30     165    4.6
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Niko         TX  green    Lamb    2      70    8.3

In [57]:
sd.sort_index()

          state  color    food  age  height  score
Aaron        FL    red   Mango   12     120    9.0
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2
Dean         AK   gray  Cheese   32     180    1.8
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Penelope     AL  white   Apple    4      80    3.3